app/views/lists/index.html.erb

                <ul>
                    <% l.items.each do |i|%>
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]