app/views/lists/show.html.erb

  <h4>List:</h4>
  <% if !@list.items.any? %>
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]
SELECT 1 AS one FROM "items" WHERE "items"."list_id" = ? LIMIT ?  [["list_id", 1], ["LIMIT", 1]]

    <ul>
      <% @list.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]