app/controllers/items_controller.rb

    def new
        @list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @list = List.find(params[:list_id])
        @item = @list.items.create(item_params)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "items" ("name", "quantity", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Toothpaste"], ["quantity", 2], ["list_id", 1], ["created_at", "2021-10-15 10:38:56.404325"], ["updated_at", "2021-10-15 10:38:56.404325"]]

    def show
        @item = Item.find_by_id(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @item = Item.find(params[:id])
        @list = List.find(params[:list_id])
        @item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 8]]