app/controllers/lists_controller.rb

    def create
        @list = List.new(list_params)
        @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Shopping"], ["created_at", "2021-10-14 10:29:36.319201"], ["updated_at", "2021-10-14 10:29:36.319201"]]

    def show
        @list = List.find_by_id(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @list = List.find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @list = List.new(list_params)

        if @list.save
---
INSERT INTO "lists" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Shopping"], ["description", "List of items to get from coles\r\n"], ["created_at", "2021-10-16 10:28:15.504678"], ["updated_at", "2021-10-16 10:28:15.504678"]]

    def destroy
        @list = List.find(params[:id])
        @list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]